# Importando, limpiando y exportando Database

In [1]:
import pandas as pd 
import numpy as np
import matplotlib.pyplot as plt
import seaborn as sns

In [2]:
pd.set_option('display.max_columns', None)

In [3]:
#Leo el Dataset

df = pd.read_csv("../Databases/project3_salaries_initial.csv")
df

,timestamp,company,level,title,totalyearlycompensation,location,yearsofexperience,yearsatcompany,tag,basesalary,stockgrantvalue,bonus,gender,otherdetails,cityid,dmaid,rowNumber,Masters_Degree,Bachelors_Degree,Doctorate_Degree,Highschool,Some_College,Race_Asian,Race_White,Race_Two_Or_More,Race_Black,Race_Hispanic,Race,Education
0,06-07-2017 11:33,Oracle,L3,Product Manager,127000,"Redwood City, CA",1.5,1.5,NaN,107000,20000.0,10000.0,NaN,NaN,7392,807.0,1,0,0,0,0,0,0,0,0,0,0,NaN,NaN
1,06-10-2017 17:11,eBay,SE 2,Software Engineer,100000,"San Francisco, CA",5.0,3.0,NaN,0,0.0,0.0,NaN,NaN,7419,807.0,2,0,0,0,0,0,0,0,0,0,0,NaN,NaN
2,06-11-2017 14:53,Amazon,L7,Product Manager,310000,"Seattle, WA",8.0,0.0,NaN,155000,0.0,0.0,NaN,NaN,11527,819.0,3,0,0,0,0,0,0,0,0,0,0,NaN,NaN
3,6/17/2017 0:23:14,Apple,M1,Software Engineering Manager,372000,"Sunnyvale, CA",7.0,5.0,NaN,157000,180000.0,35000.0,NaN,NaN,7472,807.0,7,0,0,0,0,0,0,0,0,0,0,NaN,NaN
4,6/20/2017 10:58:51,Microsoft,60,Software Engineer,157000,"Mountain View, CA",5.0,3.0,NaN,0,0.0,0.0,NaN,NaN,7322,807.0,9,0,0,0,0,0,0,0,0,0,0,NaN,NaN
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
62637,09-09-2018 11:52,Google,T4,Software Engineer,327000,"Seattle, WA",10.0,1.0,Distributed Systems (Back-End),155000,150000.0,22000.0,NaN,NaN,11527,819.0,1973,0,0,0,0,0,0,0,0,0,0,NaN,NaN
62638,9/13/2018 8:23:32,Microsoft,62,Software Engineer,237000,"Redmond, WA",2.0,2.0,Full Stack,146900,73200.0,16000.0,NaN,NaN,11521,819.0,2037,0,0,0,0,0,0,0,0,0,0,NaN,NaN
62639,9/13/2018 14:35:59,MSFT,63,Software Engineer,220000,"Seattle, WA",14.0,12.0,Full Stack,157000,25000.0,20000.0,NaN,NaN,11527,819.0,2044,0,0,0,0,0,0,0,0,0,0,NaN,NaN
62640,9/16/2018 16:10:35,Salesforce,Lead MTS,Software Engineer,280000,"San Francisco, CA",8.0,4.0,iOS,194688,57000.0,29000.0,NaN,NaN,7419,807.0,2097,0,0,0,0,0,0,0,0,0,0,NaN,NaN
62641,1/29/2019 5:12:59,apple,ict3,Software Engineer,200000,"Sunnyvale, CA",0.0,0.0,ML / AI,155000,27000.0,19000.0,Male,NaN,7472,807.0,5424,0,0,0,0,0,0,0,0,0,0,NaN,NaN

In [4]:
#Renombro las columnas para que todas tengan el formato de lowercase y pegado

df.rename(columns={'rowNumber': 'rownumber', 'Masters_Degree' : 'mastersdegree', 'Bachelors_Degree':'bachelorsdegree', 'Doctorate_Degree':'doctoratedegree', 'Highschool':'highschool', 'Some_College':'somecollege','Race_Asian':'raceasian', 'Race_White':'racewhite', 'Race_Two_Or_More':'racetwoormore', 'Race_Black':'raceblack', 'Race_Hispanic':'racehispanic','Race':'race', 'Education':'education'}, inplace=True)

In [5]:
#Info general del df

df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 62642 entries, 0 to 62641
Data columns (total 29 columns):
 #   Column                   Non-Null Count  Dtype
---  ------                   --------------  -----
 0   timestamp                62642 non-null  object
 1   company                  62637 non-null  object
 2   level                    62523 non-null  object
 3   title                    62642 non-null  object
 4   totalyearlycompensation  62642 non-null  int64
 5   location                 62642 non-null  object
 6   yearsofexperience        62642 non-null  float64
 7   yearsatcompany           62642 non-null  float64
 8   tag                      61788 non-null  object
 9   basesalary               62642 non-null  int64
 10  stockgrantvalue          62642 non-null  float64
 11  bonus                    62642 non-null  float64
 12  gender                   43102 non-null  object
 13  otherdetails             40137 non-null  object
 14  cityid                   62642 non-null  int64
 15  dmaid                    62640 non-null  float64
 16  rownumber                62642 non-null  int64
 17  mastersdegree            62642 non-null  int64
 18  bachelorsdegree          62642 non-null  int64
 19  doctoratedegree          62642 non-null  int64
 20  highschool               62642 non-null  int64
 21  somecollege              62642 non-null  int64
 22  raceasian                62642 non-null  int64
 23  racewhite                62642 non-null  int64
 24  racetwoormore            62642 non-null  int64
 25  raceblack                62642 non-null  int64
 26  racehispanic             62642 non-null  int64
 27  race                     22427 non-null  object
 28  education                30370 non-null  object
dtypes: float64(5), int64(14), object(10)
memory usage: 13.9+ MB

In [6]:
#Cuenta de valores NaN por columna

df.isnull().sum()

timestamp                      0
company                        5
level                        119
title                          0
totalyearlycompensation        0
location                       0
yearsofexperience              0
yearsatcompany                 0
tag                          854
basesalary                     0
stockgrantvalue                0
bonus                          0
gender                     19540
otherdetails               22505
cityid                         0
dmaid                          2
rownumber                      0
mastersdegree                  0
bachelorsdegree                0
doctoratedegree                0
highschool                     0
somecollege                    0
raceasian                      0
racewhite                      0
racetwoormore                  0
raceblack                      0
racehispanic                   0
race                       40215
education                  32272
dtype: int64

In [7]:
#Cuenta de valores duplicados

df.duplicated().sum()

0

In [8]:
#Datos estadísticos de las columnas con valores numéricos

df.describe()

,totalyearlycompensation,yearsofexperience,yearsatcompany,basesalary,stockgrantvalue,bonus,cityid,dmaid,rownumber,mastersdegree,bachelorsdegree,doctoratedegree,highschool,somecollege,raceasian,racewhite,racetwoormore,raceblack,racehispanic
count,6.264200e+04,62642.000000,62642.000000,6.264200e+04,6.264200e+04,62642.000000,62642.000000,62640.000000,62642.000000,62642.000000,62642.000000,62642.000000,62642.000000,62642.000000,62642.000000,62642.000000,62642.000000,62642.000000,62642.000000
mean,2.163004e+05,7.204135,2.702093,1.366873e+05,5.148608e+04,19334.746588,9856.201989,616.097222,41694.723732,0.245698,0.201223,0.028783,0.005108,0.005667,0.187925,0.128221,0.012835,0.011015,0.018039
std,1.380337e+05,5.840375,3.263656,6.136928e+04,8.187457e+04,26781.292040,6679.104563,289.843390,24488.865879,0.430504,0.400917,0.167196,0.071291,0.075067,0.390655,0.334338,0.112562,0.104373,0.133094
min,1.000000e+04,0.000000,0.000000,0.000000e+00,0.000000e+00,0.000000,0.000000,0.000000,1.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000
25%,1.350000e+05,3.000000,0.000000,1.080000e+05,0.000000e+00,1000.000000,7369.000000,506.000000,20069.250000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000
50%,1.880000e+05,6.000000,2.000000,1.400000e+05,2.500000e+04,14000.000000,7839.000000,807.000000,42019.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000
75%,2.640000e+05,10.000000,4.000000,1.700000e+05,6.500000e+04,26000.000000,11521.000000,807.000000,63021.750000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000
max,4.980000e+06,69.000000,69.000000,1.659870e+06,2.800000e+06,1000000.000000,47926.000000,881.000000,83875.000000,1.000000,1.000000,1.000000,1.000000,1.000000,1.000000,1.000000,1.000000,1.000000,1.000000

In [9]:
#Valores únicos por columna

df.nunique()

timestamp                  61755
company                     1631
level                       2916
title                         15
totalyearlycompensation      893
location                    1050
yearsofexperience             65
yearsatcompany                81
tag                         3058
basesalary                   482
stockgrantvalue              612
bonus                        335
gender                         4
otherdetails               12839
cityid                      1045
dmaid                        149
rownumber                  62642
mastersdegree                  2
bachelorsdegree                2
doctoratedegree                2
highschool                     2
somecollege                    2
raceasian                      2
racewhite                      2
racetwoormore                  2
raceblack                      2
racehispanic                   2
race                           5
education                      5
dtype: int64

In [10]:
#Distribución de empresas

df["company"].value_counts()

Amazon                      8126
Microsoft                   5216
Google                      4330
Facebook                    2990
Apple                       2028
                            ...
Samsung research America       1
Bny Mellon                     1
yelp                           1
Bloomberg lp                   1
tableau software               1
Name: company, Length: 1631, dtype: int64

In [11]:
#Distribución de puestos

df["title"].value_counts()

Software Engineer               41231
Product Manager                  4673
Software Engineering Manager     3569
Data Scientist                   2578
Hardware Engineer                2200
Product Designer                 1516
Technical Program Manager        1381
Solution Architect               1157
Management Consultant             976
Business Analyst                  885
Marketing                         710
Mechanical Engineer               490
Sales                             461
Recruiter                         451
Human Resources                   364
Name: title, dtype: int64

## Pendientes: 

- Quitar columnas de race, education, otherdetails, highschool, somecollege LISTO
- Ver si sí hay estandarización en levels dentro de cada compañía y ver si tiene relación con años de experiencia 
- Organizar años de experiencia por categorías
- Recortar nombres de compañías haciéndolo todo lowercase LISTO
- Estandarizar los timestamps, quitarles la hora LISTO
- Revisar qué tan estandarizado están los Tags, considerar quitarlo

In [12]:
#Quitamos columnas

df.drop(columns=["race", "education", "otherdetails", "highschool", "somecollege", "basesalary", "stockgrantvalue","bonus"], inplace = True)
df

,timestamp,company,level,title,totalyearlycompensation,location,yearsofexperience,yearsatcompany,tag,gender,cityid,dmaid,rownumber,mastersdegree,bachelorsdegree,doctoratedegree,raceasian,racewhite,racetwoormore,raceblack,racehispanic
0,06-07-2017 11:33,Oracle,L3,Product Manager,127000,"Redwood City, CA",1.5,1.5,NaN,NaN,7392,807.0,1,0,0,0,0,0,0,0,0
1,06-10-2017 17:11,eBay,SE 2,Software Engineer,100000,"San Francisco, CA",5.0,3.0,NaN,NaN,7419,807.0,2,0,0,0,0,0,0,0,0
2,06-11-2017 14:53,Amazon,L7,Product Manager,310000,"Seattle, WA",8.0,0.0,NaN,NaN,11527,819.0,3,0,0,0,0,0,0,0,0
3,6/17/2017 0:23:14,Apple,M1,Software Engineering Manager,372000,"Sunnyvale, CA",7.0,5.0,NaN,NaN,7472,807.0,7,0,0,0,0,0,0,0,0
4,6/20/2017 10:58:51,Microsoft,60,Software Engineer,157000,"Mountain View, CA",5.0,3.0,NaN,NaN,7322,807.0,9,0,0,0,0,0,0,0,0
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
62637,09-09-2018 11:52,Google,T4,Software Engineer,327000,"Seattle, WA",10.0,1.0,Distributed Systems (Back-End),NaN,11527,819.0,1973,0,0,0,0,0,0,0,0
62638,9/13/2018 8:23:32,Microsoft,62,Software Engineer,237000,"Redmond, WA",2.0,2.0,Full Stack,NaN,11521,819.0,2037,0,0,0,0,0,0,0,0
62639,9/13/2018 14:35:59,MSFT,63,Software Engineer,220000,"Seattle, WA",14.0,12.0,Full Stack,NaN,11527,819.0,2044,0,0,0,0,0,0,0,0
62640,9/16/2018 16:10:35,Salesforce,Lead MTS,Software Engineer,280000,"San Francisco, CA",8.0,4.0,iOS,NaN,7419,807.0,2097,0,0,0,0,0,0,0,0
62641,1/29/2019 5:12:59,apple,ict3,Software Engineer,200000,"Sunnyvale, CA",0.0,0.0,ML / AI,Male,7472,807.0,5424,0,0,0,0,0,0,0,0

In [13]:
#Distribución de empresas después de hacer todo lowercase

df["company"] = df["company"].str.lower()
df["company"].value_counts().head(20)

amazon            8199
microsoft         5241
google            4362
facebook          3004
apple             2047
oracle            1143
salesforce        1065
intel              966
ibm                927
cisco              923
uber               893
capital one        786
linkedin           750
vmware             682
qualcomm           573
jpmorgan chase     542
bloomberg          537
goldman sachs      475
paypal             451
intuit             450
Name: company, dtype: int64

### Irnos solo con el top 20 de empresas

In [14]:
#Estandarizar Timestamps

#pd.to_datetime(df["timestamp"])


df["timestamp"] = pd.to_datetime(df["timestamp"]).dt.date
df

,timestamp,company,level,title,totalyearlycompensation,location,yearsofexperience,yearsatcompany,tag,gender,cityid,dmaid,rownumber,mastersdegree,bachelorsdegree,doctoratedegree,raceasian,racewhite,racetwoormore,raceblack,racehispanic
0,2017-06-07,oracle,L3,Product Manager,127000,"Redwood City, CA",1.5,1.5,NaN,NaN,7392,807.0,1,0,0,0,0,0,0,0,0
1,2017-06-10,ebay,SE 2,Software Engineer,100000,"San Francisco, CA",5.0,3.0,NaN,NaN,7419,807.0,2,0,0,0,0,0,0,0,0
2,2017-06-11,amazon,L7,Product Manager,310000,"Seattle, WA",8.0,0.0,NaN,NaN,11527,819.0,3,0,0,0,0,0,0,0,0
3,2017-06-17,apple,M1,Software Engineering Manager,372000,"Sunnyvale, CA",7.0,5.0,NaN,NaN,7472,807.0,7,0,0,0,0,0,0,0,0
4,2017-06-20,microsoft,60,Software Engineer,157000,"Mountain View, CA",5.0,3.0,NaN,NaN,7322,807.0,9,0,0,0,0,0,0,0,0
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
62637,2018-09-09,google,T4,Software Engineer,327000,"Seattle, WA",10.0,1.0,Distributed Systems (Back-End),NaN,11527,819.0,1973,0,0,0,0,0,0,0,0
62638,2018-09-13,microsoft,62,Software Engineer,237000,"Redmond, WA",2.0,2.0,Full Stack,NaN,11521,819.0,2037,0,0,0,0,0,0,0,0
62639,2018-09-13,msft,63,Software Engineer,220000,"Seattle, WA",14.0,12.0,Full Stack,NaN,11527,819.0,2044,0,0,0,0,0,0,0,0
62640,2018-09-16,salesforce,Lead MTS,Software Engineer,280000,"San Francisco, CA",8.0,4.0,iOS,NaN,7419,807.0,2097,0,0,0,0,0,0,0,0
62641,2019-01-29,apple,ict3,Software Engineer,200000,"Sunnyvale, CA",0.0,0.0,ML / AI,Male,7472,807.0,5424,0,0,0,0,0,0,0,0

In [15]:
df["level"].str.contains("E6").any()

True

In [16]:
#Nuevo Dataframe con el top20 de empresas

top_20_companies = df["company"].value_counts().nlargest(20).index
top_20_companies

top_20_df = df[df["company"].isin(top_20_companies)].copy()
top_20_df["totalyearlycompensation"].describe()

count    3.401600e+04
mean     2.390896e+05
std      1.445726e+05
min      1.000000e+04
25%      1.590000e+05
50%      2.080000e+05
75%      2.850000e+05
max      4.980000e+06
Name: totalyearlycompensation, dtype: float64

In [17]:
top_20_df["title"].nunique()

15

In [18]:
top_20_df["title"] = df["title"].str.lower()
top_20_df["title"].nunique()

15

In [19]:
#Columna de IDs

top_20_df.insert(0, "id", range(1, len(top_20_df)+1))
top_20_df

,id,timestamp,company,level,title,totalyearlycompensation,location,yearsofexperience,yearsatcompany,tag,gender,cityid,dmaid,rownumber,mastersdegree,bachelorsdegree,doctoratedegree,raceasian,racewhite,racetwoormore,raceblack,racehispanic
0,1,2017-06-07,oracle,L3,product manager,127000,"Redwood City, CA",1.5,1.5,NaN,NaN,7392,807.0,1,0,0,0,0,0,0,0,0
2,2,2017-06-11,amazon,L7,product manager,310000,"Seattle, WA",8.0,0.0,NaN,NaN,11527,819.0,3,0,0,0,0,0,0,0,0
3,3,2017-06-17,apple,M1,software engineering manager,372000,"Sunnyvale, CA",7.0,5.0,NaN,NaN,7472,807.0,7,0,0,0,0,0,0,0,0
4,4,2017-06-20,microsoft,60,software engineer,157000,"Mountain View, CA",5.0,3.0,NaN,NaN,7322,807.0,9,0,0,0,0,0,0,0,0
5,5,2017-06-21,microsoft,63,software engineer,208000,"Seattle, WA",8.5,8.5,NaN,NaN,11527,819.0,11,0,0,0,0,0,0,0,0
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
62635,34012,2018-09-06,amazon,sde2,software engineer,170000,"Seattle, WA",2.0,2.0,Distributed Systems (Back-End),NaN,11527,819.0,1888,0,0,0,0,0,0,0,0
62637,34013,2018-09-09,google,T4,software engineer,327000,"Seattle, WA",10.0,1.0,Distributed Systems (Back-End),NaN,11527,819.0,1973,0,0,0,0,0,0,0,0
62638,34014,2018-09-13,microsoft,62,software engineer,237000,"Redmond, WA",2.0,2.0,Full Stack,NaN,11521,819.0,2037,0,0,0,0,0,0,0,0
62640,34015,2018-09-16,salesforce,Lead MTS,software engineer,280000,"San Francisco, CA",8.0,4.0,iOS,NaN,7419,807.0,2097,0,0,0,0,0,0,0,0
62641,34016,2019-01-29,apple,ict3,software engineer,200000,"Sunnyvale, CA",0.0,0.0,ML / AI,Male,7472,807.0,5424,0,0,0,0,0,0,0,0

In [21]:
top_20_df.to_csv("../Databases/top_20.csv", index=False)